<script setup>
import Header from './components/Header.vue';
import Footer from './components/Footer.vue';
import earth from './assets/images/articles/earth.jpg';
import vscode from './assets/images/articles/vscode.jpg';

const articles = [
	{
		id: 1,
		tag: 'Javascript',
		title:
			'Как с помощью Dadata определить город по IP?',
		descr:
			'Делюсь информацией о том, как определить местоположение по IP',
		fullPostInfo: [
			{
				postInfo: `На работе потребовалось запилить задачу для автоматического определения города при совершении заказа. Было решено сделать это на фронте, ибо бек был занят`,
			},
			{
				postInfo: `Как известно, фронт не умеет определять IP и город. В первом случае, он без бека не сможет получить IP, во втором
				случае, ему	нужно запрашивать разрешение на определение геолокации юзера, где всплывает бесящее окно с просьбой дать
				разрешение.`,
			},
			{
				postInfo: `Метод костыльный, но рабочий (на 80%). Почему 80%? Дело в том, что точно определить город юзера практически 
				невозможно и сервисы могут ошибаться. Например, я живу в г. Назрань, а мне выдает г. Сунжа (~30 км. от моего города).`,
			},
		],
		img: earth,
	},
	{
		id: 2,
		tag: 'Советы',
		title:
			'Мои темы и плагины для VS Code на 2019 год',
		descr:
			'Так как спрашивают не в первый раз, сделаю отдельную запись со списком тем и плагинов',
		fullPostInfo: [
			{
				postInfo: `На работе потребовалось запилить задачу для автоматического определения города при совершении заказа. Было решено сделать это на фронте, ибо бек был занят`,
			},
			{
				postInfo: `Как известно, фронт не умеет определять IP и город. В первом случае, он без бека не сможет получить IP, во втором
				случае, ему	нужно запрашивать разрешение на определение геолокации юзера, где всплывает бесящее окно с просьбой дать
				разрешение.`,
			},
			{
				postInfo: `Метод костыльный, но рабочий (на 80%). Почему 80%? Дело в том, что точно определить город юзера практически 
				невозможно и сервисы могут ошибаться. Например, я живу в г. Назрань, а мне выдает г. Сунжа (~30 км. от моего города).`,
			},
		],
		img: vscode,
	},
];
</script>

<template>
	<Header />

	<router-view :articles="articles" />

	<Footer />
</template>
